// スタート
const RANDOM_SENTENCE_URL_API = "https://api.quotable.io/random";




// 文字があっているかの判定
// inputテキスト入力。あっているかどうかの判定

// タイプ音をつける

// 文字と文字を比較する
// ディスプレイに表示されているSpanタグを取得

// 自分で打ち込んだテキストを取得

// 次の文章へ

// ちゃんとthenかawaitで待たないと欲しいデータが入らない。
// 非同期でランダムな文章を取得する



//     ここでならちゃんと文章情報を取り扱うことができる。


// 次のランダムな文章を取得する

// ディスプレイに表示されているSpanタグを取得

// 文章を1文字ずつ分解して、spanタグを生成する(クラス付与のため)

// characterSpan.classList.add("correct");

// 確認

// テキストボックスの中身を消す。

// タイマーのリセット

// カウントアップを開始する

// 現在の時刻を表示

// 1秒ずれて呼び出される

//     現在の時刻 - 1秒前の時刻 = 1s